


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Адрес = Параметры.АдресВременногоХранилища;  
    ОтпускаСотрудников = ПолучитьИзВременногоХранилища(Адрес); 
    
    Для каждого Элемент Из ОтпускаСотрудников Цикл
    
    	 Точка = АнализОтпусков.УстановитьТочку(Элемент.Сотрудник.Наименование); 
         Серия = АнализОтпусков.УстановитьСерию("Отпуск"); 
         ЗначениеДГ = АнализОтпусков.ПолучитьЗначение(Точка, Серия);  
               
         Интервал = ЗначениеДГ.Добавить(); 
         Интервал.Начало = Элемент.ДатаНачала; 
         Интервал.Конец = Элемент.ДатаОкончания; 

	 КонецЦикла;   
	
КонецПроцедуры


